<img src="images/pandas-intro.png">

# Learning Agenda of this Notebook:
- What is Pandas and how is it used in AI?
- Key features of Pandas
- Data Types in Pandas
- What does Pandas deal with?

- Creating Series in Pandas
    - From Python List
    - From NumPy Arrays
    - From Python Dictionary
    - From a scalar value
    - Creating empty series object
- Attributes of a Pandas Series
- Arithmetic Operations on Series

- Dataframes in Pandas
    - Anatomy of a Dataframe
    - Creating Dataframe
        - An empty dataframe
        - Two-Dimensional NumPy Array
        - Dictionary of Python Lists
        - Dictionary of Panda Series
    - Attributes of a Dataframe
    - Bonus
- Different file formats in Pandas 
- Indexing, Subsetting and Slicing Dataframes
    - Practice Exercise I
- Modifying Dataframes
- Data Handling with Pandas
  - Practice Exercise I
  - Practice Exercise II
- All Statistical functions in Pandas
- Input/Output Operations
- Aggregation & Grouping
  - Practice Exercise
- Merging, Joining and Concatenation
  - Practice Exercise
- How To Perform Data Visualization with Pandas
- Exercise I
- Exercise II
- Pandas's Assignment

## Outline
1. Modifying Column labels of Dataframe
2. Modifying Row indices of Dataframe
3. Modifying Row(s) Data (Records) of a Dataframe
   - Modifying a single Row
   - Modifying multiple Rows
       - `map()` Method
       - `df.remove()` Method
       - `df.apply()` Method
       - `df.replace()` Method
4. Add a New Column in a Dataframe
5. Delete an Existing Column from a Dataframe
6. Add a New Row in  a Dataframe
7. Delete an Existing Row(s) from a Dataframe
8. Adding a New Column with Conditional Values
9. Deleting Row(s) Based on Specific Condition
10. Delete a Column  Based on Specific Condition
11. Change Datatype of a Pandas Series
12. Sorting dataframes using `df.sort_values()`
13. Sorting dataframes using `df.sort_index()`
14. Practice Exercise

### Read a Sample File

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# !cat datasets/groupdata.csv

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
df.tail(3)

In [ ]:
# df.shape
# df.columns
# df.dtypes
# df.index
# df.describe(include='all')
# df.info()
# df.sample(3)
# df.isnull().sum() # or df.isna().sum()
# df.nunique()
# df['address'].value_counts()

### 1. Modifying Column Names of a Dataframe
- Convert Columns into lowercase
- Convert Columns into uppercase
- Remove spaces from Columns
- Rename Columns using `rename()`

In [ ]:
df.columns

##### Revision of str.upper()

In [ ]:
str1 = "ehtisham"
# str1
# print(dir(str1))
str1.upper()

In [ ]:
df.columns = df.columns.str.upper()
df.columns = df.columns.str.replace(' ','_')
df.columns = df.columns.str.replace('-','_')

In [ ]:
df.columns

> **Question: How to rename columns while reading data and after loaded data?**

In [ ]:
# df.rename(columns={'SUBJ1':'SUBJECT1'} ) # after loading data
# pd.read_csv('datasets/groupdata.csv', names=['SUBJ1']) # before loading data

### 2. Modifying the Row Indices of a DataFrame
- df.set_index('id')
- df.reset_index(drop=True)

In [ ]:
df.set_index('ROLL_NO', inplace=True)

In [ ]:
df

In [ ]:
df.reset_index(inplace=True)
df

### 3. Modifying Data of a Single Row/Record of a Dataframe

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

####   Get the row/record you want to modify
Let us suppose we want to change the `subj1` and `subj2` marks of `Ayesha`

In [ ]:
# Returns a Series object
df.loc[1,:]

In [ ]:
df.name=='Ayesha'

In [ ]:
# Returns a Dataframe object
df.loc[df.name=='Ayesha', :]

##### Option 1:
- One way is to pass a new list of values and assign it to the appropriate series (row)

In [ ]:
# Any of the following two LOC will work
# 1st Method
df.loc[1,:] = ['2', 'Ayesha', 16, 'Islamabad', 'AFT', 'group A', 'Female', 99, 99, 6000.0]

In [ ]:
# 2nd Method
df.loc[df.name=='Ayesha', :] = ['2', 'Ayesha', 16, 'Islamabad', 'AFT', 'group A', 'Female', 99, 99, 6000.0]

In [ ]:
df.head(3)

##### Option 2:
- A better way is to assign only those two values that we want to change instead of assigning the complete list of values in that row

In [ ]:
# Returns a series
df = pd.read_csv('datasets/groupdata.csv')
df.loc[1,:]

In [ ]:
df.loc[1, ['subj1', 'subj2']]

In [ ]:
# Returns a dataframe
df.loc[df.name=='Ayesha', ['subj1', 'subj2']]

In [ ]:
# 1st Method
df.loc[1, ['subj1', 'subj2']] = [100, 90]

In [ ]:
# 2nd Method
df.loc[df.name=='Ayesha', ['subj1', 'subj2']] = [100, 100]

In [ ]:
df.head(3)

**Note: You can also use `df.iloc[]` method instead of `df.loc[]` to change multiple or single value of a row. Other than these two you may also try using `df.at[]` method to change a single value of a row.**
```
df.loc[filter, 'column(s)'] = 'value(s)'
```

##  Modify Data of Multiple Rows and 
- Uptill now we have learnt to modify a single, multiple or all the values of a single row in a dataframe.
- What if we want to modify multiple rows at a time?
- The following methods will come for your rescue:
    - `map()`
    - `df.replace()`
    - `df.apply()`
    - `df.applymap()`

#### a. The Python Built-in `map()` Method
- The ```map(aFunction, *iterables)``` function simply returns a map object after applying  `aFunction()` to all the elements of `iterable(s)`. 
- Later you can type cast the map object to appropriate data structure
- The original iterable(s) remains unchanged.

In [ ]:

list1 = [3,4,5,6,7,78,76,56]
print(list1)

In [ ]:
# Function to check if a number is even then return square of that number, 
# else return cube of that number
list1 = [3,4,5,6,7,78,76,56]

def return_square_cube(x):
    if x%2==0:
        return x**2
    else:
        return x**3
    
obj1 = map(return_square_cube, list1)
print(list(obj1))

**Example:** Using built-in function with `map()`

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
df['name']

In [ ]:
len("Ehtisham")

In [ ]:
# Passing a Series object (a column of dataframe) to map() as argument
# The Python built-in `len()` function is applied to all the values of name column and return a map object
map(len, df['name'])

In [ ]:
df['name_length_1st'] = pd.Series(map(len, df['name']))

In [ ]:
df.head(3)

In [ ]:
print(dir(df['name']))

In [ ]:
# Another way is to call the map() method by a Series object using dot notation
df['name'].map(len)

In [ ]:
# Third way is to access the column name as well using dot notation
df['name_length_2nd'] = df.name.map(len)

In [ ]:
df.sample(5)

**Example:** Using a user-defined function with `map()`

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
# Let us pass a user-defined function
def myfunc(x):
    if (x > 18):
        return "Young"
    else:
        return "Teenager"

df['age'].map(myfunc)

In [ ]:
# If you want to save this as a new column in the dataframe you can do that
df['newcol'] = df['age'].map(myfunc)

In [ ]:
df.head(3)

In [ ]:
df['newcol'].value_counts()

### Bonus

In [ ]:
import seaborn as sns
import matplotlib.pyplot as plt
import warnings
warnings.filterwarnings('ignore')

sns.countplot(df['newcol'])
plt.show()

**Example:** Using a Lambda function with `map()`

In [ ]:
df['age'].map(lambda x: "Adult" if x > 18 else "Child")

**Example:** Using a Lambda Function with `map()`

In [ ]:
# You cannot pass upper to map() as we have passed len to map() 
# as upper() is not a built-in function rather is a method of string class
#df['name'].map(upper)

In [ ]:
df['name'].map(lambda x: x.upper())
# df.name.map(lambda x:x.lower())

**Example:** Passing a Dictionary {oldval:newval} to `map()` for changing selected values of a categorical column

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head()

In [ ]:
df.session.unique() # df['session'].unique()

In [ ]:
# print(dir(df['session']))

In [ ]:
df['session'].map({'MORNING':'M', 'AFTERNOON':'A'})

In [ ]:
df['session'].map({'MORNING':'M', 'AFTERNOON':'A', 'AFT':'F','MOR':'M'})

>**Limitations of `map()` Method**
>- If there are values for which there is no match, the old values are changed and have become NaN. Solution is use `df.replace()` method
>- You can use it on an iterable or Series object not with entire dataframe. Solution is use `df.apply()` and `df.applymap()`

#### b. The `df.replace()` Method
- The `df.replace()` method is used to replace values given in `to_replace` with `value`
- The matching values in the entire dataframe are replaced with new values dynamically.
- This differs from updating with ``.loc`` or ``.iloc``, which require you to specify a location to update with some value.

```
df.replace(to_replace, value, inplace=False)
```

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')
df.head()

In [ ]:
df['session'].replace({'MORNING':'M', 'AFTERNOON':'A'})

>- Note that now there are no NaN values, rather the values that do not have a match remains as such
>- Another important point is `replace()` method works equally well with dataframe

In [ ]:
# Calling replace on entire dataframe
df.replace({'MORNING':'M', 'AFTERNOON':'A', 'group A':'GROUP-A','Ehtisham':'Ehtisham Sadiq'}, inplace=True)

In [ ]:
# Above operation is not inplace
df

#### c. The `df.apply()` Method
- The `df.apply()` method is used to run a function along the mentioned axis of the dataframe. 
- In simple words, `apply()` method runs a function on all the elements of a series of a dataframe

```
df.apply(func, axis=0, args)
```
- Where,
    - `func`: It can be a built-in, user-defined or a lambda function that is applied to every series of the dataframe as per the axis argument. (Objects passed to the func are series objects)
    - `axis`: The default value of axis argument is zero, so the func is applied to each column. If you want to apply the func to the values of a row, mention axis as one.
    - `args` : If you want to pass additional arguments to `func` in addition to the element of series, you can pass them as a tuple.

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
len("Ehtisham")

In [ ]:
# Let us pass the built-in function `len()` and compute the length of each name under the name column of df
# So now the len() method is applied to all the values of a single column and return a series object
df['name'].apply(len)

In [ ]:
# Let us pass a user-defined function, with an additional argument as well. This was not possible with map() method
def myfunc( age):
    if age < 18:
        return "Young"
    else:
        return "Old"

df['age'].apply(myfunc)

In [ ]:
# Let us use Lambda function to convert each name under the name column of df to upper case
df['name'].apply(lambda x : x.upper())

In [ ]:
# If you are satisfied with the result, you may assign it to the specific column
df['name'] = df['name'].apply(lambda x : x.upper())

In [ ]:
df

**Question**: Can anyone guess what this LOC will do?

```df['subj1'] = df['subj1'].apply(lambda x : x+5)```

In [ ]:
df['subj1'] = df['subj1'].apply(lambda x : x+5)

In [ ]:
df.head()

#### b. The `df.applymap()` Method
- The `df.map()` method applies a function to datafreame element wise.

```
df.applymap(func, axis=0)
```
- Where,
    - `func`: A function that is passed a single value and returns a single value.
    
Note: A Series object do not have a `applymap()` method, so you cannot call it with a Series object

In [ ]:
df = pd.read_csv('datasets/groupdata.csv')

In [ ]:
df_string = df.loc[:,['name','address','session', 'group', 'gender']]
df_numeric = df.loc[:,['age','subj1','subj2','scholarship']]

In [ ]:
df_string.applymap(str.upper).head()

In [ ]:
# The applymap() method will apply the len function on each element of dataframe 
df_numeric.applymap(lambda x : x+5).head(5)

### Bonus

In [ ]:
import seaborn as sns
df = sns.load_dataset('titanic')

In [ ]:
df.head()

In [ ]:
# distribution of fare
df.fare.describe()

In [ ]:
df['fare'].dtype

In [ ]:
def convert_fare_into_discrete_classes(value):
    if isinstance(value, float):
        if value <= 7.1904 and value >= 0.0:
            return "Low Fare"
        elif value <= 31.00 and value > 7.9104:
            return "Normal Fare"
        else:
            return "High Fare"
    else:
        return "Irrelevent Class"

In [ ]:
df['fare'].apply(convert_fare_into_discrete_classes).value_counts()

## 4. Add a New Column in a Dataframe
- To add a new column in a dataframe, create an appropriate series and then assign it to the dataframe
- Every time a new series is added to a dataframe, its name automatically becomes an attribute of that dataframe.
- It can be a series created from scratch, which can be numbersome if the dataframe has thousands of rows.
- Another common way to add a column is construct a series from the existing data within the dataframe
- Let us understand this with an example

In [ ]:
df

In [ ]:
df.shape

In [ ]:
np.random.randint(50,95,16) # this returns numpy array

In [ ]:
pd.Series(np.random.randint(50,95,16))

In [ ]:
# adding new column using pandas series method
df['subj3'] = pd.Series(np.random.randint(50,95,16))
df.head()

In [ ]:
df

**Question:** Create a new Column name `Eligibility` from marks of all the subjects. If marks are greater than 70%, student will be `Eligibility` for scholarship.

In [ ]:
(df[['subj1', 'subj2', 'subj3']].sum(axis=1) / 300)*100

In [ ]:
((df[['subj1','subj2','subj3']].sum(axis=1)/300)*100) > 70

In [ ]:
# create a new column to find the students those are eligible for scholarship
df['Eligibility'] = ((df[['subj1','subj2','subj3']].sum(axis=1)/300)*100) > 70
df

In [ ]:
df.Eligibility = df.Eligibility.replace({True:'Eligible',False:'Not_Eligible'})

In [ ]:
df.Eligibility.value_counts()

## 5. Delete an Existing Column from a Dataframe
- You can use any of the following ways to delete a column from a dataframe:
    - Use `del df['colname']`, which will remove the column, but will not return it
    - Use `df.pop('colname')` method which will remove that column as well as return the deleted column as a series
    - Use `df.drop()` is a better method than the above two. It can delete more than one columns and is not inplace. Moreover, it can be used to delete rows as well

####  Option 1: Using `del df['colname']`
- The `del df['colname']` will remove the column without returning it. It is inplace

In [ ]:
del df['Eligibility']

In [ ]:
df.columns

#### Option 2: Using `df.pop('colname')`
- The `df.pop('colname')` method will remove the column and will return the Series that has been removed from the dataframe. It is inplace

In [ ]:
df.pop('subj3')

In [ ]:
df.columns

####  Option 3: Using `df.drop()`
- The `df.drop()` method is used to remove one or more columns and will return a Series or Dataframe object accordingly.

```
df.drop(columns=[---],  axis=1, inplace=False)
```
- If you want to drop more than one columns, pass the names of columns to be deleted as a Python List to the `columns` parameter and to the `axis` argument pass 1. (`axis` argument specifies the direction of operation, which is left to right while deleting columns)
- By default it is not inplace. Most of Pandas methods that return a dataframe has an inplace paremeter with default value set to False. It means the operation will not effect the underlying change

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head(3)

In [ ]:
# drop just one column
df.drop(columns = 'name')

In [ ]:
# Remember axis is the direction of operation, and axis=1 is the column axis that goes from left to right
df.drop(columns=['name', 'age', 'address'], axis=1)

> It has just returned the resulting dataframe after removing the columns. No change has made to the original dataframe

Let us repeat the operation, with `inplace=True`. Note this time it will return None. However, changes has been made to the original dataframe

In [ ]:
df.drop(columns=['name', 'age', 'address'], axis=1, inplace=True)

In [ ]:
df.head()

## 6. Add a New Row in  a Dataframe
- To add a new row in a dataframe, create an appropriate dataframe and then use `df.append()` method, which will return a new dataframe with the row added.
```
df.append(other, ignore_index=False)
```

In [ ]:
import numpy as np
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.tail()

In [ ]:
# Let us create a new dataframe having a single row
newdf = pd.DataFrame(
     data = [[18, 'Suleman', 28, 'Lahore','AFT', 'group D', 'Male', 75.0, 65.0, 9999]],
     columns = ['roll no','name', 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2', 'scholarship']
)
newdf

In [ ]:
df.append(newdf, ignore_index=True)

In [ ]:
# df.append(newdf)

In [ ]:
# Let us create a new dataframe having a single row
newdf = pd.DataFrame(
     data = [[18, 'Suleman', 28, 'Lahore','AFT', 'group D', 'Male', 75.0, 65.0]],
     columns = ['roll no','name', 'age', 'address', 'session', 'group', 'gender','subj1', 'subj2']
)
newdf

> **Note:** The index associated with the only row in above dataframe is 0. Moreover, the sequence of columns is not same (name is coming before rollno)

In [ ]:
df = df.append(newdf, ignore_index=True )
df.tail()

- Note that the due to `ignore_index=True` argument it has been assigned the next available index. Otherwise, the new row will also have row index 0.
- Moreover, note the NaN value under the scholarship column against the new added row
- One last thing, the `df.append()` method do not have `inplace` argument, so you always have to assign the resulting dataframe to the original `df`. 
- Please check this out as to why `df.drop()` has `inplace` argument, while **`df.append()` does not have `inplace` argument.**

## 8. Delete an Existing Row(s) from a Dataframe
- The `df.drop()` method is used to remove one or more rows (other than columns) and will return a Series or Dataframe object accordingly.

```
df.drop(index=[---],  axis=0, inplace=False)
```
- If you want to drop more than one rows, pass the row indices to be deleted as a Python List to the `index` parameter and to the `axis` argument pass 0. (`axis` argument specifies the direction of operation, which is top to bottom while deleting rows)
- By default it is not inplace. Most of Pandas methods that return a dataframe has an inplace paremeter with default value set to False. It means the operation will not effect the underlying change

In [ ]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head()

In [ ]:
df.loc[[2,4]]

In [ ]:
df.drop(index=[2,4], axis=0, inplace = True)

In [ ]:
df

## 8. Adding a New Column with Conditional Values

In [2]:
import pandas as pd
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0

**Example:** Add a new column `total` that contains sum of marks in `subj1` and `subj2`. Then add a new column that should contain string `"Good"` if `total>150` other wise string `"Bad"`

In [4]:
df[['subj1','subj2']]

    subj1  subj2
0    78.3   84.4
1    70.5   60.5
2    64.9   75.1
3    82.0   84.3
4    65.9   72.8
5    69.3   78.6
6    90.2    NaN
7    84.1   76.0
8    90.5   81.3
9    90.5   81.3
10   90.5   81.3
11   90.5   81.3
12    NaN   76.5
13   84.1   76.0
14   90.5   81.3
15   90.5   81.3

In [6]:
# df['total'] = df['subj1'] + df['subj2']
# df['total']

In [9]:
df['total'] = df['subj1'].add(df['subj2'], fill_value=0)

In [12]:
df.sample(5)

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship,total
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0,171.8
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0,166.3
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN,171.8
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN,147.9
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0,171.8

In [13]:
def add_status(value):
    if value>150:
        return "Good"
    else:
        return "Bad"
df['status'] = df['total'].apply(add_status)

> Try: Using Lambda Function

## 9. Deleting Row(s) Based on Specific Condition

In [36]:
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0

In [37]:
df['session'] == 'AFT'

0     False
1      True
2     False
3     False
4      True
5     False
6      True
7     False
8      True
9     False
10    False
11    False
12    False
13    False
14     True
15    False
Name: session, dtype: bool

In [38]:
df[df['session'] == 'AFT']

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN,4000.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0

In [39]:
df[df['session'] == 'AFT'].index

Int64Index([1, 4, 6, 8, 14], dtype='int64')

In [33]:
# Let us drop an entire row from the data frame, in which session is 'AFT'
# Get the indices where session == 'AFT' using the .index function
indices = df[df['session'] == 'AFT'].index
indices

Int64Index([1, 4, 6, 8, 14], dtype='int64')

In [41]:
df.drop(index=indices, inplace=True)

In [42]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0

In [28]:
# Complete Code
df.drop(index = df[df['session']=='AFT'].index, inplace=True)
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0

## 10. Delete a Column  Based on Specific Condition

In [43]:
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0

**Example:** Let us drop the column(s) from above data frame, if it has >= than 2 NaN values.

In [47]:
# 35% missing value -> drop
df.isna().sum() >= 2

roll no        False
name           False
age            False
address        False
session        False
group          False
gender         False
subj1          False
subj2          False
scholarship     True
dtype: bool

In [50]:
col_indices = df.columns[df.isna().sum() >= 2]
col_indices

Index(['scholarship'], dtype='object')

In [52]:
df.drop(columns = col_indices, inplace=True)

In [53]:
df

,roll no,name,age,address,session,group,gender,subj1,subj2
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3
12,13,Yusuf,18,Lahore,MORNING,group D,Male,NaN,76.5
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3

> Try: Drop all the columns where missing values are greater and equal to 1 using lambda function.

## 11. Change Datatype of a Pandas Series
- Use the `astype(dtype)` method to cast a pandas object to a specified dtype ``dtype``.

#### a. Changing Datatype from `int64` to `float64`

In [60]:
df = pd.read_csv('datasets/groupdata.csv')
df.dtypes

roll no          int64
name            object
age              int64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [63]:
#Suppose we want to change the datatype of `age` column to float64 dtype
df['age'] = df['age'].astype(float)
df.dtypes

roll no          int64
name            object
age            float64
address         object
session         object
group           object
gender          object
subj1          float64
subj2          float64
scholarship    float64
dtype: object

In [61]:
# convert a string into int if a string is only numeric.
str1 = "1223"
int(str1)

1223

In [62]:
str1 = "ab23"
int(str1)

ValueError: invalid literal for int() with base 10: 'ab23'

#### b. Changing Datatype from `string` to `boolean`.

In [64]:
df = pd.read_csv('datasets/groupdata.csv')
df.head()

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0

In [65]:
df.gender.str.contains('Male')

0      True
1     False
2      True
3      True
4      True
5     False
6      True
7     False
8     False
9      True
10     True
11    False
12     True
13    False
14     True
15    False
Name: gender, dtype: bool

In [67]:
df['gender'] = df.gender.str.contains('Male').astype(int)
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,1,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,0,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,1,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,1,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,1,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,0,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,1,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,0,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,0,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,1,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,1,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,0,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,group D,1,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,0,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,1,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,0,90.5,81.3,3800.0

## 12. Sorting dataframes using `df.sort_values()`

>Pandas data frame has two useful functions. **`df.sort_values()`** to sort by values of one or more columns and **`df.sort_index()`** to sort by the index. Each of these functions come with numerous options, like sorting in specific order (ascending or descending), sorting in place, sorting with missing values, sorting by specific algorithm etc.
- The `df.sort_values()` function sort by the values along either axis.
```
df.sort_values(by,axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `by`: str or list of str to sort
-  `axis`: If `axis` is 0 or 'index' then 'by' may contain index levels and/or column labels. If `axis` is 1 or 'columns' then 'by' may contain column levels and/or index labels.
- `ascending`: if True then ascending and if False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [2]:
import pandas as pd

data = {
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Ehtisham', 'Ayesha', 'Ali', 'Khubaib', 'Dua'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Okara', 'Lahore', 'Karachi', 'Okara']
}

df = pd.DataFrame(data=data)
df

   roll_no      name gender grade  marks     city
0      102  Ehtisham      M     A     21   Lahore
1      101    Ayesha      F     A     23    Okara
2      104       Ali      M     B     12   Lahore
3      103   Khubaib      M     B     14  Karachi
4      105       Dua      F     A     20    Okara

#### a. Sorting by Single Column

In [3]:
# Let us sort the data by grade column
# By default the sorting is done in ascending order and is not inplace
df1 = df.sort_values(by=['grade'])
df1

   roll_no      name gender grade  marks     city
0      102  Ehtisham      M     A     21   Lahore
1      101    Ayesha      F     A     23    Okara
4      105       Dua      F     A     20    Okara
2      104       Ali      M     B     12   Lahore
3      103   Khubaib      M     B     14  Karachi

- Note in above output, we have sorted the data based on the `grade` column. You can observe that some of the students with higher marks are ranked lower.
- We want to sort the data based on both grades and marks.

#### b. Sorting by Multiple Columns

In [4]:
# sort the dataframe
df2 = df.sort_values(by=['grade','marks'])
df2

   roll_no      name gender grade  marks     city
4      105       Dua      F     A     20    Okara
0      102  Ehtisham      M     A     21   Lahore
1      101    Ayesha      F     A     23    Okara
2      104       Ali      M     B     12   Lahore
3      103   Khubaib      M     B     14  Karachi

- Note that the data is first sorted by grade, and then within grade it is sorted by marks
- But still the problem is not solved. Actually we want to sort by grade in ascending order and by marks in descending order.

In [5]:
df3 = df.sort_values(by=['grade','marks'], ascending=[True,False])
df3

   roll_no      name gender grade  marks     city
1      101    Ayesha      F     A     23    Okara
0      102  Ehtisham      M     A     21   Lahore
4      105       Dua      F     A     20    Okara
3      103   Khubaib      M     B     14  Karachi
2      104       Ali      M     B     12   Lahore

#### c. Role of NaN Values in Sorting

In [6]:
df = pd.read_csv('datasets/groupdata.csv')
df

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN,4000.0
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN
12,13,Yusuf,18,Lahore,MORNING,NaN,Male,NaN,76.5,7000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0

In [7]:
# If there is a missing value NaN, by default it is listed at the end when using sort_values function
# Regardless of the sorting order (Ascending or Descending)
df.sort_values(by='scholarship')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN,4000.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,13,Yusuf,18,Lahore,MORNING,NaN,Male,NaN,76.5,7000.0
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN

In [8]:
# If the argument na_position='first', it will be listed at the top.
df.sort_values(by=['scholarship'], na_position='first')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
5,6,Khadija,16,Lahore,MORNING,group C,Female,69.3,78.6,NaN
11,12,Muskan,20,Karachi,AFTERNOON,group C,Female,90.5,81.3,NaN
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0
9,10,Hassan,15,Lahore,AFTERNOON,group D,Male,90.5,81.3,3800.0
15,16,Dua,11,Multan,AFTERNOON,group A,Female,90.5,81.3,3800.0
3,4,Aisha,20,Lahore,MOR,group A,Male,82.0,84.3,4000.0
6,7,Omar,12,Sialkot,AFT,group B,Male,90.2,NaN,4000.0
0,1,Ehtisham,23,Lahore,MORNING,group C,Male,78.3,84.4,5000.0
1,2,Ayesha,16,Islamabad,AFT,group A,Female,70.5,60.5,6000.0
10,11,Hussein,12,Islamabad,MOR,group B,Male,90.5,81.3,6000.0
12,13,Yusuf,18,Lahore,MORNING,NaN,Male,NaN,76.5,7000.0
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0

>- Checkout the `df.nlargest()` method which return the first `n` rows ordered by `columns` in descending order.
>- Checkout the `df.nsmallest()` method which return the first `n` rows ordered by `columns` in ascending order.

In [9]:
df.nsmallest(3, 'scholarship')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
4,5,Ahmed,21,Peshawer,AFT,group D,Male,65.9,72.8,3500.0
8,9,Zainab,18,Karachi,AFT,group C,Female,90.5,81.3,3500.0
14,15,Khubaib,13,Sialkot,AFT,group C,Male,90.5,81.3,3500.0

In [10]:
df.nlargest(3, 'scholarship')

,roll no,name,age,address,session,group,gender,subj1,subj2,scholarship
2,3,Ali,20,Karachi,AFTERNOON,group B,Male,64.9,75.1,8500.0
7,8,Adeen,4,Multan,MORNING,group D,Female,84.1,76.0,8000.0
13,14,Amina,28,Multan,AFTERNOON,group A,Female,84.1,76.0,8000.0

In [11]:
# df.sort_values(by=['scholarship'], na_position='first', ascending=False)
# df.nlargest(3, 'scholarship')
# df.nsmallest(3, 'scholarship')

## 13. Sorting dataframes using `df.sort_index()`
> We have observed while using `df.sort_values()`, by default the sorting is performed in the vertical direction. If you want to sort in the row direction, we can set the`axis` argument of  `df.sort_values()` method to 1, which is by default set to zero. However, it may cause problems when a number and a string are mixed

- So to sort a dataframe in the horizontal direction, we normally use **`df.sort_index()`** method.
```
df.sort_index(axis=0,ascending=True,inplace=False,kind='quicksort',na_position='last',ignore_index=False)
```
Where,
-  `axis`: The axis along which to sort. The value 0 identifies the rows, and 1 identifies the columns. (default is 0)
- `ascending`: If True then ascending and If False then descending
- `inplace`:  If True, perform operation in-place.
- `kind`: {'quicksort', 'mergesort', 'heapsort', 'stable'}, default 'quicksort'. This option is only applied when sorting on a single column or label.
- `na_position`: If first then puts NaNs at the beginning. Default is last
- `ignore_index`: If True, the resulting axis will be labeled 0, 1, …, n - 1. Default False

In [12]:
import pandas as pd
df = pd.DataFrame({
    'roll_no': [ 102, 101, 104, 103, 105],
    'name' : ['Ehtisham', 'Ayesha', 'Ali', 'Khubaib', 'Dua'],
    'gender' : ['M', 'F', 'M', 'M', 'F'],
    'grade'  : ['A', 'A', 'B', 'B', 'A'],
    'marks'  : [ 21,  23,  12,  14,  20],
    'city' : ['Lahore', 'Okara', 'Lahore', 'Karachi', 'Okara']
})
df

   roll_no      name gender grade  marks     city
0      102  Ehtisham      M     A     21   Lahore
1      101    Ayesha      F     A     23    Okara
2      104       Ali      M     B     12   Lahore
3      103   Khubaib      M     B     14  Karachi
4      105       Dua      F     A     20    Okara

#### a. Sort by Column Labels
- By passing the axis argument with a value 0 or 1, the sorting can be done on the column labels. By default, axis=0

In [13]:
df1 = df.sort_index(axis=1)
df1

      city gender grade  marks      name  roll_no
0   Lahore      M     A     21  Ehtisham      102
1    Okara      F     A     23    Ayesha      101
2   Lahore      M     B     12       Ali      104
3  Karachi      M     B     14   Khubaib      103
4    Okara      F     A     20       Dua      105

#### b. Sort by Index
- The first question that might come in your mind, is that why do we need to sort by index. We can see in above dataframe the row indices are in numeric order. And if the row indices are disturbed due to may be sorting by the values of some column, we can use `reset_index()` method to make the row indices again in increasing numeric order.
<br><br>
- To understand this, let us follow following three steps:
    - Set the `roll_no` column as index
    - Call `sort_index()` with axis=0
    - Call `reset_index()`

In [14]:
# Lets us set the roll_no column as index
df1 = df.set_index(["roll_no"])
df1

             name gender grade  marks     city
roll_no
102      Ehtisham      M     A     21   Lahore
101        Ayesha      F     A     23    Okara
104           Ali      M     B     12   Lahore
103       Khubaib      M     B     14  Karachi
105           Dua      F     A     20    Okara

> Note that the implicit index collumn is dropped and the roll_no column has become the index of this dataframe.

In [15]:
# sort the datframe by index 
df2 = df1.sort_index(axis=0)
df2

             name gender grade  marks     city
roll_no
101        Ayesha      F     A     23    Okara
102      Ehtisham      M     A     21   Lahore
103       Khubaib      M     B     14  Karachi
104           Ali      M     B     12   Lahore
105           Dua      F     A     20    Okara

In [16]:
# After sort you can reset the index if you want
df3 = df2.reset_index(drop=False)
df3

   roll_no      name gender grade  marks     city
0      101    Ayesha      F     A     23    Okara
1      102  Ehtisham      M     A     21   Lahore
2      103   Khubaib      M     B     14  Karachi
3      104       Ali      M     B     12   Lahore
4      105       Dua      F     A     20    Okara

## Practice Questions Part 1: 
- Step 1. Import the necessary libraries.
- Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/ehtisham-sadiq/P0Q6R9S2-MLZone/main/Module%2004%20-%20Python%20for%20Data%20Scientists/datasets/u.user)
- Step 3. Assign it to a variable called users and use the `user_id` as index
- Step 4. See the first 25 entries
- Step 5. See the last 10 entries
- Step 6. What is the number of observations in the dataset?
- Step 7. What is the number of columns in the dataset?
- Step 8. Print the name of all the columns.
- Step 9. How is the dataset indexed?
- Step 10. What is the data type of each column?
- Step 11. Print only the occupation column
- Step 12. How many different occupations are in this dataset?
- Step 13. What is the most frequent occupation?
- Step 14. Summarize the DataFrame.
- Step 15. Summarize all the columns
- Step 16. Summarize only the occupation column
- Step 17. What is the mean age of users?
- Step 18. What is the age with least occurrence?

In [18]:
url = "https://raw.githubusercontent.com/ehtisham-sadiq/P0Q6R9S2-MLZone/main/Module%2004%20-%20Python%20for%20Data%20Scientists/datasets/u.user"

In [17]:
# step 01: import all necessary libraries
import pandas as pd
import numpy as np

In [19]:
# step 02: read the dataset
users = pd.read_csv(url, sep="|")
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

In [20]:
users.set_index('user_id', inplace=True)

In [21]:
users.head()

         age gender  occupation zip_code
user_id
1         24      M  technician    85711
2         53      F       other    94043
3         23      M      writer    32067
4         24      M  technician    43537
5         33      F       other    15213

In [22]:
# step 4: See first 25 records
users.head(25)

         age gender     occupation zip_code
user_id
1         24      M     technician    85711
2         53      F          other    94043
3         23      M         writer    32067
4         24      M     technician    43537
5         33      F          other    15213
6         42      M      executive    98101
7         57      M  administrator    91344
8         36      M  administrator    05201
9         29      M        student    01002
10        53      M         lawyer    90703
11        39      F          other    30329
12        28      F          other    06405
13        47      M       educator    29206
14        45      M      scientist    55106
15        49      F       educator    97301
16        21      M  entertainment    10309
17        30      M     programmer    06355
18        35      F          other    37212
19        40      M      librarian    02138
20        42      F      homemaker    95660
21        26      M         writer    30068
22        25      M         writer    40206
23        30      F         artist    48197
24        21      F         artist    94533
25        39      M       engineer    55107

In [23]:
# step 5: See last 10 records
users.tail(10)

         age gender     occupation zip_code
user_id
934       61      M       engineer    22902
935       42      M         doctor    66221
936       24      M          other    32789
937       48      M       educator    98072
938       38      F     technician    55038
939       26      F        student    33319
940       32      M  administrator    02215
941       20      M        student    97229
942       48      F      librarian    78209
943       22      M        student    77841

In [24]:
# step 6: How many records are there?
users.shape

(943, 4)

In [25]:
# step 8: print the name of columns
users.columns

Index(['age', 'gender', 'occupation', 'zip_code'], dtype='object')

In [26]:
# step 9: index of dataset
users.index

Int64Index([  1,   2,   3,   4,   5,   6,   7,   8,   9,  10,
            ...
            934, 935, 936, 937, 938, 939, 940, 941, 942, 943],
           dtype='int64', name='user_id', length=943)

In [27]:
# what is the datatype of each column
users.dtypes

age            int64
gender        object
occupation    object
zip_code      object
dtype: object

In [28]:
# print only occupation column
users['occupation']

user_id
1         technician
2              other
3             writer
4         technician
5              other
           ...
939          student
940    administrator
941          student
942        librarian
943          student
Name: occupation, Length: 943, dtype: object

In [30]:
# - Step 12. How many different occupations are in this dataset?
# - Step 13. What is the most frequent occupation?
# - Step 14. Summarize the DataFrame.
# - Step 15. Summarize all the columns
# - Step 16. Summarize only the occupation column
# - Step 17. What is the mean age of users?
# - Step 18. What is the age with least occurrence?
users['occupation'].unique()

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [32]:
users['occupation'].value_counts().head(1)

student    196
Name: occupation, dtype: int64

In [34]:
users.describe(include='all')

               age gender occupation zip_code
count   943.000000    943        943      943
unique         NaN      2         21      795
top            NaN      M    student    55414
freq           NaN    670        196        9
mean     34.051962    NaN        NaN      NaN
std      12.192740    NaN        NaN      NaN
min       7.000000    NaN        NaN      NaN
25%      25.000000    NaN        NaN      NaN
50%      31.000000    NaN        NaN      NaN
75%      43.000000    NaN        NaN      NaN
max      73.000000    NaN        NaN      NaN

In [35]:
users['occupation'].describe()

count         943
unique         21
top       student
freq          196
Name: occupation, dtype: object

In [36]:
users['age'].mean()

34.05196182396607

In [37]:
users['age'].value_counts().tail(1)

73    1
Name: age, dtype: int64

In [ ]:
# import pandas as pd
# pd.Series([])
# pd.DataFrame(dict)
# shape
# info() -> indcies of columns, columns name, total null values, datatype of each column, range of indcies
# dtypes -> return datatype of all columns
# describe() -> descriptive view dataset/dataframe (mean, max, min, std, count)
# head() -> top records/rows/indcies
# tail() -> last 5 records
# unique()  -> all unique values in given column(it is invalid for continous data)
# nunique() -> return count of unique values
# value_counts() -> return unique values along with their frequency

In [1]:
from IPython.core.display import HTML

style = """
    <style>
        body {
            background-color: #f2fff2;
        }
        h1 {
            text-align: center;
            font-weight: bold;
            font-size: 36px;
            color: #4295F4;
            text-decoration: underline;
            padding-top: 15px;
        }
        
        h2 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #4A000A;
            text-decoration: underline;
            padding-top: 10px;
        }
        
        h3 {
            text-align: left;
            font-weight: bold;
            font-size: 30px;
            color: #f0081e;
            text-decoration: underline;
            padding-top: 5px;
        }

        
        p {
            text-align: center;
            font-size: 12 px;
            color: #0B9923;
        }
    </style>
"""

html_content = """
<h1>Hello</h1>
<p>Hello World</p>
<h2> Hello</h2>
<h3> World </h3>
"""

HTML(style + html_content)

## Interview Process:
- Written Test (PF, OOP, DBMS, DSA, OS(optional), CN(optional))
- Technical Interview conducted by a Senior Software Eng. (PF, OOP, DBMS, DSA, FYP(imp))
- HR Interview

**FYP**:
- Web
- AI
- Game 
- Mobile
- Cyber-Sec
- Robustics
- AR/VR
- Desktop

In [69]:
# Web
# AI/Data Science
# Mobile App

### Salary
- AI >> Web

## Two Paths:

- **Web Developer** : (Html, CSS, JS, PHP, MySQL)
    - JS(entry-advance)
    - React.js, Node.js, MySQL, MongDB
    - Projects
    - Deployment(AWS, GCS, Azure)
    - FYP(Web Based)
    - OOP, PF, DSA, DBMS
    - Salary(90k-110k)
  
- **Data Science/Machine Learning/AI**
    - Image Processing (Computer Vision){Python, Libraries, Project)
    - OOP, PF, DSA, DBMS (Comp) -> Python
    - Sklearn, pandas, numpy, seaborn, pytorch